read_verilog prio.v
hierarchy -check -top prio
write_json prio.rtl.json
